// CPE 一星題
// e578. 10222 - Decode the Mad man

#include <iostream>
#include <map>

using namespace std;

int main() {
	map<char, char> Decode = {
		// 第一排
		{'2','`'}, {'3','1'},{'4','2'},{'5','3'},{'6','4'},{'7','5'},{'8','6'},{'9','7'},{'0','8'},{'-','9'},{'=','0'},
		//  第二排
		{'e','q'},{'r','w'},{'t','e'},{'y','r'},{'u','t'},{'i','y'},{'o','u'},{'p','i'},{'[','o'},{']','p'},{'\\','['}, // 這考點是: 跳脫符號
		// 第三排
		{'d','a'},{'f','s'},{'g','d'},{'h','f'},{'j','g'},{'k','h'},{'l','j'},{';','k'},{'\'','l'},
		// 第四排
		{'c','z'},{'v','x'},{'b','c'},{'n','v'},{'m','b'},{',','n'},{'.','m'},{'/',','},
	};


	char c;
	// 這串會在遇到EOF之後結束
	while (cin.get(c)) {
		if (Decode.count(c)) {
			cout << Decode[c];
		}
		else {
			cout << c;
		}
	}
}
